# Домашнее задание к занятию 1. Знакомство с Python

## Задание 1
Напишите программу, которая последовательно запрашивает у пользователя Дату и Описание задачи, а затем выводит их через пробел.

Пример ввода-вывода программы: 
```
Введите дату: Сегодня
Введите задачу: Сделать все дела
Сегодня Сделать все дела
```

### Ответ:
Задание доступно в [приложенном файле](../Homeworks_py/01/Task01.1.py):
```python
dateTask = input("Введите дату: ")
descriptionTask = input("Введите задачу: ")

print(dateTask + " : " + descriptionTask)
```

## Задание 2
Модифицируйте программу из задания 1 таким образом, чтобы запрос даты и задачи выполнялся трижды и после этого результаты выводились на экран построчно в формате: на одной строчке дата и задача через пробел.

Пример ввода-вывода программы:
```
Введите дату: Сегодня
Введите задачу: Выучить Python
Введите дату: Завтра
Введите задачу: Разработать TODO-приложение
Введите дату: Послезавтра
Введите задачу: Разработать Telegram-бота
Сегодня Выучить Python
Завтра Разработать TODO-приложение
Послезавтра Разработать Telegram-бота
```

### Ответ:
Задание выполнено с помощью цикла `for` и применением словаря. Задание доступно в [приложенном файле](../Homeworks_py/01/Task01.2.py):
```python
todo = dict()

for i in range(3):
    dateTask = input("Введите дату: ")
    descriptionTask = input("Введите задачу: ")
    todo[dateTask] = descriptionTask

for key, value in todo.items():
    print(key + " : " + value)
```

## Задание 3
Модифицируйте программу из задания 2 таким образом, чтобы данные не выводились на экран, а сохранялись в словарь. Ключами в этом словаре должны быть даты, а значениями - соответствующие им задачи.

Пример ввода программы:
```
Введите дату: Сегодня
Введите задачу: Выучить Python
Введите дату: Завтра
Введите задачу: Разработать TODO-приложение
Введите дату: Послезавтра
Введите задачу: Разработать Telegram-бота
```
Это задание не предполагает вывод информации на экран.

### Ответ:
Предыдущее задание уже выполнено с применением словаря, убираем вывод на экран. Задание доступно в [приложенном файле](../Homeworks_py/01/Task01.2.py):
```python
todo = dict()

for i in range(3):
    dateTask = input("Введите дату: ")
    descriptionTask = input("Введите задачу: ")
    todo[dateTask] = descriptionTask
```

### Подсказки 
* Для запроса данных у пользователя используйте функцию `input`.
* Для вывода данных на экран используйте функцию `print`.
* Сохраняйте нужные вам данные в переменные.

***
